Catalogs/Товары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Товары</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействующаяСкидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНаСкладе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Товары/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиентеПроцедура изображениеНажатие(Элемент, СтандартнаяОбработка)  СтандартнаяОбработка = Ложь;   Режим = РежимДиалогаВыбораФайла.Открытие;   ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим);   ДиалогОткрытия.ПолноеИмяФайла = "";   Фильтр = "Файл Jpg (*.jpg)|*.jpg";   ДиалогОткрытия.Фильтр = Фильтр;   ДиалогОткрытия.МножественныйВыбор = Ложь;   ДиалогОткрытия.Заголовок = "Выберете файл для загрузки";   ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиФайла",ЭтаФорма);   ДиалогОткрытия.Показать(ОписаниеОповещения);  КонецПроцедуры&НаКлиенте Процедура ПослеЗагрузкиФайла(ВыбранныйФайл,ДопПараметр) Экспорт   Если ВыбранныйФайл = Неопределено Тогда     Возврат;   КонецЕсли;   ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПомещенияФайла", ЭтаФорма);   НачатьПомещениеФайла(ОписаниеОповещения,, ВыбранныйФайл[0], Ложь, УникальныйИдентификатор); КонецПроцедуры&НаКлиенте Процедура ПослеПомещенияФайла(Результат, Адрес, ВыбранноеИмяФайла,ДопПараметры) Экспорт   Если Не Результат Тогда     Возврат;   КонецЕсли;   СсылкаНаКартинку = Адрес;   Модифицированность = Истина; КонецПроцедуры&НаСервереПроцедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)  Если ЭтоАдресВременногоХранилища(СсылкаНаКартинку)  Тогда     ФайлКартинки = ПолучитьИзВременногоХранилища(СсылкаНаКартинку);     ТекущийОбъект.Фото = Новый ХранилищеЗначения(ФайлКартинки);     УдалитьИзВременногоХранилища(СсылкаНаКартинку);     СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Фото");   КонецЕсли;КонецПроцедуры&НаСервереПроцедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Фото");КонецПроцедуры 


&НаСервере
Процедура ПриОткрытииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	Если Объект.ДействующаяСкидка <> 0 Тогда   
		ЭтаФорма.РеальнаяЦена = Число(Объект.Цена) - Число(Объект.Цена) / 100 * Объект.ДействующаяСкидка;
		Элементы.Цена.ЦветТекста = WebЦвета.Красный; 
		Элементы.Цена.Шрифт = Новый Шрифт(Элементы.Цена.Шрифт,,,,,,Истина);
	КонецЕсли;
	
		
	ПриОткрытииНаСервере();
КонецПроцедуры
